# ГрафКомикс — Документация по проектной практике

## Описание проекта

**ГрафКомикс** представляет собой сообщество, объединяющее как создателей комиксов, так и их читателей, а также тех, кто стремится реализовать себя в данной сфере. 
Цель: создание информационного веб-ресурса для публикации читателями веб-комиксов, их просмотра в свободном доступе, комментирования и распространения

## Структура статического сайта для практики

```
.
site/
├── css/
│   └── styles.css
├── html/
│   ├── main.html
│   └── journal.html
│   └── about.html
│   └── participants.html
│   └── resources.html
├── fonts/
└──  img/
```

# Страницы сайта

## Главная страница

### Хедер
- **Меню навигации**:
  - Главная
  - О проекте
  - Участники
  - Журнал
  - Ресурсы

### Баннер
- **Логотип**: «ГРАФ КОМИКС»
- **Слоган**: *«Создаем вселенную комиксов вместе»*
- **Описание**: «Здесь каждый комикс находит своего читателя»
  
### Раздел "о нас":
- **Кто мы?**: «ГрафКомикс - это сообщество читателей комиксов и тех, кто эти комиксы создаёт и мечтает создавать..»
- **Какова наша цель?**: «Публикация читателями веб-комиксов, их просмотр в свободном доступе, комментирование и распространение на сайте.»

## О проекте

#### Содержимое
- Проблематика.
- Задачи.
- Обязанности каждого подразделения.
- Ожидаемый продуктовый результат.

## Участники

Страница **«Участники»** знакомит вас с командой ГрафКомикс — СММ, программистами, художниками, организаторами.

### Здесь вы найдете:
- **Вклад каждого** участника группы практики в данный проект.
- **Имена** каждого участника проекта в целом.

## Журнал

Раздел «Журнал» - это медиа пространство.

### Здесь вы найдете:
- Мероприятия партнёров, которые посетили участники группы по практике.
- Отчёты.
- Результаты проекта в целом, события.

## Ресурсы

Страница **«Ресурсы»** содержит ссылки на материалы, которые были использованы при разработке базовой части практики.

### Здесь вы найдете:
- ТГ-канал ГрафКомикс.
- *Группа ВКонтакте ГрафКомикс.
- Канал Яндекс-Дзен ГрафКомикс.

## Участники

| Имя            | Роль                                                               |
|----------------|--------------------------------------------------------------------|
| Часовских М.О. | Разработка дизайна сайта, посещение мероприятий, написание отчётов |
| Ассауп С.К.    | Верстка сайта, посещение мероприятий, поиск информации             |
| Карлин П.      | Верстка сайта, посещение мероприятий, поиск информации             |

## Журнал прогресса

- 11.04.2025 — запуск проекта, обсуждение
- 13.04.2025 — определение темы вариативной части, распределение обязанностей, установка сроков
- 10.05.2025 — разработка дизайна сайта, поиск информации для игры Flappy Bird
- 11.05.2025 — создание игры Flappy Bird, погружение в GitHub
- 14.05.2025 — вёрстка сайта для базовой части практики
- 15.05.2025 — написание отчёта, структурирование в GitHub, перероверка

## Используемые технологии

- Git + GitHub — контроль версий
- Markdown — документация
- HTML/CSS — стилизация
- VS Code — среда разработки

## Результат

- Сайт с 5 уникальными страницами
- Игра Flappy Bird
- Взаимодействие с партнёрами
- Подробная документация и отчёт по базовой части
- Подробная документация и отчёт по вариативной части
- Работа в команде и Git-практика
